esp8266/Arduino/boards.txt
coredev.menu.FlashSize.1M512=1M (512K SPIFFS)
coredev.menu.FlashSize.1M512.build.flash_size=1M
coredev.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
coredev.menu.FlashSize.1M512.build.spiffs_start=0x7B000
coredev.menu.FlashSize.1M512.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M512.build.spiffs_blocksize=8192
coredev.menu.FlashSize.1M512.upload.maximum_size=499696

coredev.menu.FlashSize.1M256=1M (256K SPIFFS)
coredev.menu.FlashSize.1M256.build.flash_size=1M
coredev.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
coredev.menu.FlashSize.1M256.build.spiffs_start=0xBB000
coredev.menu.FlashSize.1M256.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M256.build.spiffs_blocksize=4096
coredev.menu.FlashSize.1M256.upload.maximum_size=761840

coredev.menu.FlashSize.1M192=1M (192K SPIFFS)
coredev.menu.FlashSize.1M192.build.flash_size=1M
coredev.menu.FlashSize.1M192.build.flash_ld=eagle.flash.1m192.ld
coredev.menu.FlashSize.1M192.build.spiffs_start=0xCB000
coredev.menu.FlashSize.1M192.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M192.build.spiffs_blocksize=4096
coredev.menu.FlashSize.1M192.upload.maximum_size=827376

coredev.menu.FlashSize.1M160=1M (160K SPIFFS)
coredev.menu.FlashSize.1M160.build.flash_size=1M
coredev.menu.FlashSize.1M160.build.flash_ld=eagle.flash.1m160.ld
coredev.menu.FlashSize.1M160.build.spiffs_start=0xD3000
coredev.menu.FlashSize.1M160.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M160.build.spiffs_blocksize=4096
coredev.menu.FlashSize.1M160.upload.maximum_size=860144

coredev.menu.FlashSize.1M144=1M (144K SPIFFS)
coredev.menu.FlashSize.1M144.build.flash_size=1M
coredev.menu.FlashSize.1M144.build.flash_ld=eagle.flash.1m144.ld
coredev.menu.FlashSize.1M144.build.spiffs_start=0xD7000
coredev.menu.FlashSize.1M144.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M144.build.spiffs_blocksize=4096
coredev.menu.FlashSize.1M144.upload.maximum_size=876528

coredev.menu.FlashSize.1M128=1M (128K SPIFFS)
coredev.menu.FlashSize.1M128.build.flash_size=1M
coredev.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
coredev.menu.FlashSize.1M128.build.spiffs_start=0xDB000
coredev.menu.FlashSize.1M128.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M128.build.spiffs_blocksize=4096
coredev.menu.FlashSize.1M128.upload.maximum_size=892912

coredev.menu.FlashSize.1M64=1M (64K SPIFFS)
coredev.menu.FlashSize.1M64.build.flash_size=1M
coredev.menu.FlashSize.1M64.build.flash_ld=eagle.flash.1m64.ld
coredev.menu.FlashSize.1M64.build.spiffs_start=0xEB000
coredev.menu.FlashSize.1M64.build.spiffs_end=0xFB000
coredev.menu.FlashSize.1M64.build.spiffs_blocksize=4096
coredev.menu.FlashSize.1M64.upload.maximum_size=958448

coredev.menu.FlashSize.2M=2M (1M SPIFFS)
coredev.menu.FlashSize.2M.build.flash_size=2M
coredev.menu.FlashSize.2M.build.flash_ld=eagle.flash.2m.ld
coredev.menu.FlashSize.2M.build.spiffs_start=0x100000
coredev.menu.FlashSize.2M.build.spiffs_end=0x1FB000
coredev.menu.FlashSize.2M.build.spiffs_blocksize=8192
coredev.menu.FlashSize.2M.upload.maximum_size=1044464

coredev.menu.FlashSize.4M1M=4M (1M SPIFFS)
coredev.menu.FlashSize.4M1M.build.flash_size=4M
coredev.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
coredev.menu.FlashSize.4M1M.build.spiffs_start=0x300000
coredev.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
coredev.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
coredev.menu.FlashSize.4M1M.build.spiffs_pagesize=256
coredev.menu.FlashSize.4M1M.upload.maximum_size=1044464

coredev.menu.FlashSize.4M3M=4M (3M SPIFFS)
coredev.menu.FlashSize.4M3M.build.flash_size=4M
coredev.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
coredev.menu.FlashSize.4M3M.build.spiffs_start=0x100000
coredev.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
coredev.menu.FlashSize.4M3M.build.spiffs_pagesize=256
coredev.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
coredev.menu.FlashSize.4M3M.upload.maximum_size=1044464

coredev.menu.FlashSize.8M7M=8M (7M SPIFFS)
coredev.menu.FlashSize.8M7M.build.flash_size=8M
coredev.menu.FlashSize.8M7M.build.flash_ld=eagle.flash.8m.ld
coredev.menu.FlashSize.8M7M.build.spiffs_start=0x100000
coredev.menu.FlashSize.8M7M.build.spiffs_end=0x7FB000
coredev.menu.FlashSize.8M7M.build.spiffs_pagesize=256
coredev.menu.FlashSize.8M7M.build.spiffs_blocksize=8192
coredev.menu.FlashSize.8M7M.upload.maximum_size=1044464

coredev.menu.FlashSize.16M15M=16M (15M SPIFFS)
coredev.menu.FlashSize.16M15M.build.flash_size=16M
coredev.menu.FlashSize.16M15M.build.flash_ld=eagle.flash.16m.ld
coredev.menu.FlashSize.16M15M.build.spiffs_start=0x100000
coredev.menu.FlashSize.16M15M.build.spiffs_end=0x17FB000
coredev.menu.FlashSize.16M15M.build.spiffs_pagesize=256
coredev.menu.FlashSize.16M15M.build.spiffs_blocksize=8192
coredev.menu.FlashSize.16M15M.upload.maximum_size=1044464

coredev.menu.ResetMethod.ck=ck
coredev.menu.ResetMethod.ck.upload.resetmethod=ck
coredev.menu.ResetMethod.nodemcu=nodemcu
coredev.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu

coredev.menu.Debug.Disabled=Disabled
coredev.menu.Debug.Disabled.build.debug_port=
coredev.menu.Debug.Serial=Serial
coredev.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
coredev.menu.Debug.Serial1=Serial1
coredev.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1

coredev.menu.DebugLevel.None____=None
coredev.menu.DebugLevel.None____.build.debug_level=
coredev.menu.DebugLevel.Core____=Core
coredev.menu.DebugLevel.Core____.build.debug_level=-DDEBUG_ESP_CORE
coredev.menu.DebugLevel.SSL_____=Core + SSL
coredev.menu.DebugLevel.SSL_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL
coredev.menu.DebugLevel.SSL_MEM_=Core + SSL + TLS Mem
coredev.menu.DebugLevel.SSL_MEM_.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_TLS_MEM
coredev.menu.DebugLevel.WiFic___=Core + WiFi
coredev.menu.DebugLevel.WiFic___.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI
coredev.menu.DebugLevel.WiFi____=WiFi
coredev.menu.DebugLevel.WiFi____.build.debug_level=-DDEBUG_ESP_WIFI
coredev.menu.DebugLevel.HTTPClient=HTTPClient
coredev.menu.DebugLevel.HTTPClient.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT
coredev.menu.DebugLevel.HTTPClient2=HTTPClient + SSL
coredev.menu.DebugLevel.HTTPClient2.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_SSL
coredev.menu.DebugLevel.HTTPUpdate=HTTPUpdate
coredev.menu.DebugLevel.HTTPUpdate.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE
coredev.menu.DebugLevel.HTTPUpdate2=HTTPClient + HTTPUpdate
coredev.menu.DebugLevel.HTTPUpdate2.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE
coredev.menu.DebugLevel.HTTPUpdate3=HTTPClient + HTTPUpdate + Updater
coredev.menu.DebugLevel.HTTPUpdate3.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER
coredev.menu.DebugLevel.HTTPServer=HTTPServer
coredev.menu.DebugLevel.HTTPServer.build.debug_level=-DDEBUG_ESP_HTTP_SERVER
coredev.menu.DebugLevel.UPDATER=Updater
coredev.menu.DebugLevel.UPDATER.build.debug_level=-DDEBUG_ESP_UPDATER
coredev.menu.DebugLevel.OTA_____=OTA
coredev.menu.DebugLevel.OTA_____.build.debug_level=-DDEBUG_ESP_OTA
coredev.menu.DebugLevel.OTA2____=OTA + Updater
coredev.menu.DebugLevel.OTA2____.build.debug_level=-DDEBUG_ESP_OTA -DDEBUG_ESP_UPDATER
coredev.menu.DebugLevel.all_____=All
coredev.menu.DebugLevel.all_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_TLS_MEM

coredev.menu.lwIP.legacy=v1.4 (espressif)
coredev.menu.lwIP.legacy.build.lwip_include=lwip/include
coredev.menu.lwIP.legacy.build.lwip_lib=-llwip_gcc
coredev.menu.lwIP.open=v2
coredev.menu.lwIP.open.build.lwip_include=lwip2/include
coredev.menu.lwIP.open.build.lwip_lib=-llwip2

