esp8266/Arduino/boards.txt
############ Arduino boards with Esp8266 ############

arduino-esp8266.name=Arduino

arduino-esp8266.upload.tool=esptool
arduino-esp8266.upload.speed=9600
arduino-esp8266.upload.resetmethod=ck
arduino-esp8266.upload.maximum_size=1044464
arduino-esp8266.upload.maximum_data_size=81920
arduino-esp8266.upload.wait_for_upload_port=true
arduino-esp8266.serial.disableDTR=true
arduino-esp8266.serial.disableRTS=true

arduino-esp8266.build.mcu=esp8266
arduino-esp8266.build.f_cpu=80000000L
#arduino-esp8266.build.f_crystal=40000000
arduino-esp8266.build.core=esp8266
arduino-esp8266.build.flash_mode=qio
arduino-esp8266.build.flash_size=4M
arduino-esp8266.build.flash_freq=40
arduino-esp8266.build.debug_port=
arduino-esp8266.build.debug_level=
arduino-esp8266.build.board=ESP8266_ARDUINO

arduino-esp8266.menu.BoardModel.starottodeved=Star OTTO
arduino-esp8266.menu.BoardModel.starottodeved.build.board=ESP8266_ARDUINO_STAR_OTTO
arduino-esp8266.menu.BoardModel.starottodeved.build.variant=arduino_uart
arduino-esp8266.menu.BoardModel.starottodeved.build.extra_flags=-DF_CRYSTAL=40000000

arduino-esp8266.menu.BoardModel.primo=Primo
arduino-esp8266.menu.BoardModel.primo.build.board=ESP8266_ARDUINO_PRIMO
arduino-esp8266.menu.BoardModel.primo.build.variant=arduino_spi
arduino-esp8266.menu.BoardModel.primo.build.extra_flags=-DF_CRYSTAL=40000000

arduino-esp8266.menu.BoardModel.unowifideved=Uno WiFi
arduino-esp8266.menu.BoardModel.unowifideved.build.board=ESP8266_ARDUINO_UNOWIFI
arduino-esp8266.menu.BoardModel.unowifideved.build.variant=arduino_uart
arduino-esp8266.menu.BoardModel.unowifideved.build.extra_flags=-DF_CRYSTAL=40000000

arduino-esp8266.menu.UploadSpeed.9600=9600
arduino-esp8266.menu.UploadSpeed.9600.upload.speed=9600
arduino-esp8266.menu.UploadSpeed.19200=19200
arduino-esp8266.menu.UploadSpeed.19200.upload.speed=19200
arduino-esp8266.menu.UploadSpeed.57600=57600
arduino-esp8266.menu.UploadSpeed.57600.upload.speed=57600
arduino-esp8266.menu.UploadSpeed.115200=115200
arduino-esp8266.menu.UploadSpeed.115200.upload.speed=115200
arduino-esp8266.menu.UploadSpeed.230400=230400
arduino-esp8266.menu.UploadSpeed.230400.upload.speed=230400
arduino-esp8266.menu.UploadSpeed.460800=460800
arduino-esp8266.menu.UploadSpeed.460800.upload.speed=460800

arduino-esp8266.menu.FlashSize.4M1M=4M (1M SPIFFS)
arduino-esp8266.menu.FlashSize.4M1M.build.flash_size=4M
arduino-esp8266.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
arduino-esp8266.menu.FlashSize.4M1M.build.spiffs_start=0x300000
arduino-esp8266.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
arduino-esp8266.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
arduino-esp8266.menu.FlashSize.4M1M.build.spiffs_pagesize=256

arduino-esp8266.menu.FlashSize.4M3M=4M (3M SPIFFS)
arduino-esp8266.menu.FlashSize.4M3M.build.flash_size=4M
arduino-esp8266.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
arduino-esp8266.menu.FlashSize.4M3M.build.spiffs_start=0x100000
arduino-esp8266.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
arduino-esp8266.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
arduino-esp8266.menu.FlashSize.4M3M.build.spiffs_pagesize=256

arduino-esp8266.menu.lwIP.legacy=v1.4 (espressif)
arduino-esp8266.menu.lwIP.legacy.build.lwip_include=lwip/include
arduino-esp8266.menu.lwIP.legacy.build.lwip_lib=-llwip_gcc
arduino-esp8266.menu.lwIP.open=v2
arduino-esp8266.menu.lwIP.open.build.lwip_include=lwip2/include
arduino-esp8266.menu.lwIP.open.build.lwip_lib=-llwip2

##############################################################

gen4iod.name=4D Systems gen4 IoD Range

gen4iod.upload.tool=esptool
gen4iod.upload.speed=921600
gen4iod.upload.resetmethod=nodemcu
gen4iod.upload.maximum_size=434160
gen4iod.upload.maximum_data_size=81920
gen4iod.upload.wait_for_upload_port=true
gen4iod.serial.disableDTR=true
gen4iod.serial.disableRTS=true

gen4iod.build.mcu=esp8266
gen4iod.build.f_cpu=160000000L
gen4iod.build.board=GEN4_IOD
gen4iod.build.core=esp8266
gen4iod.build.variant=generic
gen4iod.build.flash_mode=qio
# flash chip: AT25SF041 (512 kbyte, 4Mbit)
gen4iod.build.flash_size=512K
gen4iod.build.flash_ld=eagle.flash.512k0.ld
gen4iod.build.flash_freq=80
gen4iod.build.debug_port=
gen4iod.build.debug_level=

gen4iod.menu.CpuFrequency.160=160 MHz
gen4iod.menu.CpuFrequency.160.build.f_cpu=160000000L
gen4iod.menu.CpuFrequency.80=80 MHz
gen4iod.menu.CpuFrequency.80.build.f_cpu=80000000L

gen4iod.menu.UploadSpeed.115200=115200
gen4iod.menu.UploadSpeed.115200.upload.speed=115200
gen4iod.menu.UploadSpeed.9600=9600
gen4iod.menu.UploadSpeed.9600.upload.speed=9600
gen4iod.menu.UploadSpeed.57600=57600
gen4iod.menu.UploadSpeed.57600.upload.speed=57600
gen4iod.menu.UploadSpeed.256000.windows=256000
gen4iod.menu.UploadSpeed.256000.upload.speed=256000
gen4iod.menu.UploadSpeed.230400.linux=230400
gen4iod.menu.UploadSpeed.230400.macosx=230400
gen4iod.menu.UploadSpeed.230400.upload.speed=230400
gen4iod.menu.UploadSpeed.460800.linux=460800
gen4iod.menu.UploadSpeed.460800.macosx=460800
gen4iod.menu.UploadSpeed.460800.upload.speed=460800
gen4iod.menu.UploadSpeed.512000.windows=512000
gen4iod.menu.UploadSpeed.512000.upload.speed=512000
gen4iod.menu.UploadSpeed.921600=921600
gen4iod.menu.UploadSpeed.921600.upload.speed=921600

gen4iod.menu.lwIP.legacy=v1.4 (espressif)
gen4iod.menu.lwIP.legacy.build.lwip_include=lwip/include
gen4iod.menu.lwIP.legacy.build.lwip_lib=-llwip_gcc
gen4iod.menu.lwIP.open=v2
gen4iod.menu.lwIP.open.build.lwip_include=lwip2/include
gen4iod.menu.lwIP.open.build.lwip_lib=-llwip2
